GabrielNotman/AutonomoTesting/Extra UARTs/Core Files/boards.txt
# Copyright (c) 2015-2015 M2M4ALL BV.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

sodaq_autonomo.name=SODAQ Autonomo
sodaq_autonomo.vid.0=0x2341
sodaq_autonomo.pid.0=0x804d
sodaq_autonomo.vid.1=0x2341
sodaq_autonomo.pid.1=0x004d
sodaq_autonomo.upload.tool=bossac
sodaq_autonomo.upload.protocol=sam-ba
sodaq_autonomo.upload.maximum_size=262144
sodaq_autonomo.upload.use_1200bps_touch=true
sodaq_autonomo.upload.wait_for_upload_port=true
sodaq_autonomo.upload.native_usb=true
sodaq_autonomo.build.mcu=cortex-m0plus
sodaq_autonomo.build.f_cpu=48000000L
sodaq_autonomo.build.usb_product="SODAQ Autonomo"
sodaq_autonomo.build.usb_manufacturer="SODAQ"
sodaq_autonomo.build.board=SODAQ_AUTONOMO
sodaq_autonomo.build.core=arduino
sodaq_autonomo.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags}
sodaq_autonomo.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sodaq_autonomo.build.openocdscript=openocd_scripts/sodaq_autonomo.cfg
sodaq_autonomo.build.variant=sodaq_autonomo
sodaq_autonomo.build.variant_system_lib=
sodaq_autonomo.build.vid=0x2341
sodaq_autonomo.build.pid=0x804d

sodaq_autonomo_4UARTs.name=SODAQ Autonomo 4 UARTs
sodaq_autonomo_4UARTs.vid.0=0x2341
sodaq_autonomo_4UARTs.pid.0=0x804d
sodaq_autonomo_4UARTs.vid.1=0x2341
sodaq_autonomo_4UARTs.pid.1=0x004d
sodaq_autonomo_4UARTs.upload.tool=bossac
sodaq_autonomo_4UARTs.upload.protocol=sam-ba
sodaq_autonomo_4UARTs.upload.maximum_size=262144
sodaq_autonomo_4UARTs.upload.use_1200bps_touch=true
sodaq_autonomo_4UARTs.upload.wait_for_upload_port=true
sodaq_autonomo_4UARTs.upload.native_usb=true
sodaq_autonomo_4UARTs.build.mcu=cortex-m0plus
sodaq_autonomo_4UARTs.build.f_cpu=48000000L
sodaq_autonomo_4UARTs.build.usb_product="SODAQ Autonomo"
sodaq_autonomo_4UARTs.build.usb_manufacturer="SODAQ"
sodaq_autonomo_4UARTs.build.board=SODAQ_AUTONOMO
sodaq_autonomo_4UARTs.build.core=arduino
sodaq_autonomo_4UARTs.build.extra_flags=-D__SAMD21J18A__ {build.usb_flags} -DENABLE_SERIAL2 -DENABLE_SERIAL3
sodaq_autonomo_4UARTs.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
sodaq_autonomo_4UARTs.build.openocdscript=openocd_scripts/sodaq_autonomo.cfg
sodaq_autonomo_4UARTs.build.variant=sodaq_autonomo
sodaq_autonomo_4UARTs.build.variant_system_lib=
sodaq_autonomo_4UARTs.build.vid=0x2341
sodaq_autonomo_4UARTs.build.pid=0x804d
